[
  {
    "author": "Russ Gardiner",
    "rating": 3,
    "date": "May 28, 2025",
    "content": "ok overall, but a little bit clunky to use. biggest complaint is the \"delete cart\" button. it's in the exact same place as the \"save\" button when you're pricing a discount. the number of times I've deleted an entire cart after a few minutes setting it up is insane. Add a delete confirmation button!!! I would also love for an option that I can turn on that will prompt to add a customer to the sale (if you haven't yet) when you go to accept payment. I get talking and forget and it screws me",
    "helpfulCount": 91,
    "developerResponse": {
      "author": "Shopify Inc.",
      "date": "September 24, 2025",
      "content": "Thank you for your feedback. We understand the frustration with the 'delete cart' button placement and the need for a delete confirmation. Your suggestion for a prompt to add a customer before payment is valuable. We'll pass this on to our team for consideration. If you need further assistance, please visit help.shopify.com/support."
    }
  },
  {
    "author": "Christina Trexler",
    "rating": 1,
    "date": "May 7, 2025",
    "content": "recent update slows everything down and adds extra screens. It used to be upon checkout you could tap a credit card without having to select anything else. now you have to select 'credit card' before you can run the card. I don't know why they went backwards with this change. also the whole app is running more slowly after the last update",
    "helpfulCount": 224,
    "developerResponse": {
      "author": "Shopify Inc.",
      "date": "September 23, 2025",
      "content": "Thank you for your feedback. We understand the recent update has added extra steps and affected performance. We're continuously working to improve the app experience and appreciate your patience. If you have further concerns, please reach out to our support team at help.shopify.com/support."
    }
  },
  {
    "author": "Matthew Onassis",
    "rating": 1,
    "date": "December 25, 2025",
    "content": "Absolute Garbage app. It's literally POS! Sometimes it takes 1-2 minutes for the app to load on a 500 mbps internet. It keeps saying connection failed. 90% of the time products won't load on thr app. You gotta keep closing and opening it to load them and the app to accept payments. Can you imagine you're selling your products on the go, and your customers have to wait 5 minutes to load your POS for them? Do better, Shopify! Stop outsourcing everything to third world countries.",
    "helpfulCount": 9,
    "developerResponse": {
      "author": "Shopify Inc.",
      "date": "January 7, 2026",
      "content": "We understand the frustration with the app's performance. Please ensure your app is updated to the latest version. If issues persist, contact our support team at help.shopify.com/support for further assistance. We appreciate your patience as we work to improve your experience."
    }
  },
  {
    "author": "David Blatch",
    "rating": 1,
    "date": "December 24, 2025",
    "content": "So slow, not worth using. By the time the app has warmed up and reconnected to our Wisepad, which it has to do on a regular basis throughout the day, our customers have either left or are getting edgy and wanting to leave. Bad for business, makes us look unprofessional. If our entire site wasn't based on Shopify, I would look for an alternative.",
    "helpfulCount": 2,
    "developerResponse": {
      "author": "Shopify Inc.",
      "date": "January 7, 2026",
      "content": "We understand the importance of a seamless experience and apologize for the inconvenience. Please ensure your app is updated to the latest version. If the issue persists, contact our support team at help.shopify.com/support for further assistance. We appreciate your feedback and are here to help."
    }
  },
  {
    "author": "Rosie Marshall-Wilks",
    "rating": 1,
    "date": "February 6, 2026",
    "content": "urgh. seriously fix the android app. ive updated the app but yet still says \"update required\" nope it doesnt. ive also been having issues with the card reader staying connected, even though it says its connected.",
    "helpfulCount": 0,
    "developerResponse": {
      "author": "Shopify Inc.",
      "date": "February 9, 2026",
      "content": "We understand you're experiencing issues with the update prompt and card reader connectivity. Please try reinstalling the app and ensure your device's software is up-to-date. If the problem persists, contact our support team at help.shopify.com/support for further assistance."
    }
  },
  {
    "author": "Jordan Hewlett",
    "rating": 3,
    "date": "November 26, 2025",
    "content": "Simple but slow. does it job but the loading time just opening the app is frustrating when trying to make a sale.",
    "helpfulCount": 3,
    "developerResponse": null
  },
  {
    "author": "Sonya Beeler",
    "rating": 2,
    "date": "January 4, 2026",
    "content": "I do not like that I had to add a pin the phone to use this app.. find a way to secure the app without effecting my over all phone usage",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "author": "Oviex",
    "rating": 1,
    "date": "February 7, 2026",
    "content": "do not work any more keep telling me to update to the last version and I have the last version and still don't work no more.",
    "helpfulCount": 0,
    "developerResponse": {
      "author": "Shopify Inc.",
      "date": "February 9, 2026",
      "content": "It seems like you're experiencing issues with the app update. Please try reinstalling the app to see if that resolves the problem. If the issue persists, reach out to our support team at help.shopify.com/support for further assistance."
    }
  },
  {
    "author": "Rhiannon Kirby",
    "rating": 1,
    "date": "February 4, 2026",
    "content": "why would you kick a newer android off the tap to phone but a 12 yr old apple works wth... and no help to fix it but a new customer can get a free reader?",
    "helpfulCount": 0,
    "developerResponse": {
      "author": "Shopify Inc.",
      "date": "February 9, 2026",
      "content": "We understand your frustration with the device compatibility issue. Our team is continuously working to improve device support. Please reach out to our support team at help.shopify.com/support for further assistance. We appreciate your patience and feedback."
    }
  },
  {
    "author": "Austin Lehmann",
    "rating": 5,
    "date": "December 17, 2025",
    "content": "What a great app! It's a little slow BUT so convenient and its very well organized",
    "helpfulCount": 16,
    "developerResponse": null
  },
  {
    "author": "Sassy Sparkles 5 Jewelry",
    "rating": 3,
    "date": "March 27, 2024",
    "content": "I was happy with the app on my tablet. Now it shows that it updated the software. I am disappointed that the \"save cart\" feature was removed. Now it says \" save as draft\", but you need to have the paid version of Shopify Point Of Sale. This has disrupted my selling because I sometimes get payments at the end of the day, and it does not allow me to save and recall an order. Is there a way to revert to the previous version. I liked it better.",
    "helpfulCount": 52,
    "developerResponse": null
  },
  {
    "author": "Daniel Barnett",
    "rating": 1,
    "date": "March 4, 2024",
    "content": "Very poor. Images of products do not load. Occasionally they do but 90% of the time they just don't. This is on the free version so now way we're paying for the full version! Plus have to type in pin every time you want to use, even though on my already secured phone, which causes a long delay when you really just want to serve the customer. Utter trash of an app. Can put sales though once searched for each-individual-product-slowly. Sometimes receipts don't print either! Happy to revise review",
    "helpfulCount": 36,
    "developerResponse": null
  },
  {
    "author": "Natalie Parker",
    "rating": 1,
    "date": "April 27, 2024",
    "content": "I was using this at an event today, and when I go to checkout with a card, the app keeps telling me to wake up my reader. Then the app closes itself out, and I get a notification that it's crashed. I have to then try again, and MAYBE IT will work this time, which honestly takes a few more times of crashing to work. I eventually got frustrated and used my square app, which takes credit cards faster, and I don't need an extra device as I can use my phone as a tap.",
    "helpfulCount": 86,
    "developerResponse": null
  },
  {
    "author": "Yana Dee Store Team",
    "rating": 3,
    "date": "May 15, 2024",
    "content": "The recent update in mid May 2024 was for the worse. Clicking on a variant no longer adds it to the active cart. The whole purpose of this app is to add items to the cart to sell them. I don't want to look at every picture and stat of the item, I want to add it to the cart and sell it. If I wanted an in-depth analysis of the product, I would go to the Shopify app or better yet my computer. PLEASE CHANGE IT BACK!",
    "helpfulCount": 36,
    "developerResponse": null
  },
  {
    "author": "A Google user",
    "rating": 3,
    "date": "March 14, 2019",
    "content": "once set up, it's been s great app. they will ask for more information after a while, and held my money (about 10k) for a month while I submitted a copy of my id multiple times. this really impacted my ability to pay bills for my business. I even stayed on the line with them while I scanned and emailed it in. so, it works, but customer service is poor.",
    "helpfulCount": 42,
    "developerResponse": null
  },
  {
    "author": "Bijan Soularie",
    "rating": 2,
    "date": "November 15, 2024",
    "content": "Nice app with potential...and I'm saying this after using the app for several years. I wouldn't have to say that if it weren't for recent updates. Like the one with the customer choosing their receipt type. My register is not set up in a way that allows that, so now it just slows me down. Please make it so I can toggle that option on or off. I'm already tired to having to keep pressing extra buttons just to tender a sale. Also, sometimes a CASH transaction will say PAYMENT DECLINED.",
    "helpfulCount": 12,
    "developerResponse": {
      "author": "Shopify Inc.",
      "date": "November 25, 2024",
      "content": "Hello Bijan, thank you for your review. The receipt selection option can be disabled in your Shopify Admin under Point of Sale > Settings > Customer receipt selection. If you are still experiencing issues with this or with cash transactions declining, please contact us through our Help Center at help.shopify.com, and we would be happy to assist."
    }
  },
  {
    "author": "Ashley Ledgerwood",
    "rating": 1,
    "date": "June 22, 2021",
    "content": "The new app is terrible! it is so slow! It kicks you out when your in the middle of serving someone. It takes forever to bring up the products you are searching for. And once you click on it it takes you back to the start, but I have variants of products so its such a pain that I have to look it up again to click a different one! Hate the new version, the old app was so much better!",
    "helpfulCount": 28,
    "developerResponse": null
  },
  {
    "author": "Stefanie Walls",
    "rating": 2,
    "date": "May 12, 2021",
    "content": "I had the \"pleasure\" of beta testing this app. I have been waiting 5 years for an android friendly POS from shopify. I consistently get told I'm not connected to the internet. Payment transactions freeze and I was given zero guidance on hardware capabilities. I would love to add the receipt printer and barcode scanner, but no one can tell me if they are compatible. The tiles are very confusing, too. Some are grayed out and won't let me use them. I hope the developers are taking all the feedback and making adjustments.",
    "helpfulCount": 32,
    "developerResponse": null
  },
  {
    "author": "E H",
    "rating": 1,
    "date": "November 13, 2023",
    "content": "If I had a choice, I would not be using this system as a POS. Very Very slow on everything I do scanning on products, searching for products and cashing people out. The lock screen keep freezing up on me and can't get into system. I went to buy a new tablet thinking it was my old tablet problem but that is not the case. it is the app itself. I have message support team and hopefully they can figure out the problem.",
    "helpfulCount": 9,
    "developerResponse": null
  },
  {
    "author": "Holly Walker",
    "rating": 2,
    "date": "August 4, 2021",
    "content": "I'll start by saying that I love Shopify. But, I want the old app back! This app is slow and hard to navigate. Also, I have card reader issues on every Shopify app on every devise. It will never stay connected and eventually the card reader dies completely, but Shopify support will not claim it is a hardware issue. It is very frustrating. I just want the old card reader that plugs in to the phone back.",
    "helpfulCount": 74,
    "developerResponse": null
  }
]