[
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Don’t recommend",
    "rating": 1,
    "date": "2025-11-24T14:22:14-07:00",
    "author": "Matay123",
    "content": "I’ve had nothing but a bad experience with this app. It will not load up my products and also often doesn’t accept a payment from a customer. It’s a very unprofessional look for my small business, for this reason I have co tinted to rely on square and it has never let me down.",
    "developerResponse": "",
    "version": "10.15.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Becomes less functional with every update",
    "rating": 1,
    "date": "2025-10-01T22:36:44-07:00",
    "author": "Gherkin5",
    "content": "Please bring back the next button in the counting tool and “00” on the numberpad. The prompt to skip/print receipt is redundant - it makes the check out process even slower because you can’t open the register to give change before dismissing it.",
    "developerResponse": "",
    "version": "10.12.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Wise pad 3 not connect iPhone",
    "rating": 1,
    "date": "2025-05-09T07:03:39-07:00",
    "author": "St&.?",
    "content": "Can not connect to my iPhone, wise pad 3, grey out said no WiFi which it is already on",
    "developerResponse": "",
    "version": "10.1.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Still not listening to customers needs",
    "rating": 1,
    "date": "2025-05-07T18:06:15-07:00",
    "author": "Marcsydney",
    "content": "Despite multiple update, you are still not allowing merchants to apply a percentage fee to card payment. Fail fail fail!!!",
    "developerResponse": "",
    "version": "10.1.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Constant errors",
    "rating": 2,
    "date": "2025-03-05T16:52:48-07:00",
    "author": "ruthhyyyy",
    "content": "Keeps preventing me from printing receipts from pos.",
    "developerResponse": "",
    "version": "9.29.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "It used to be better",
    "rating": 1,
    "date": "2024-04-22T19:35:59-07:00",
    "author": "Top Reviewer 999",
    "content": "We got Shopify POS to use at Trade shows and it was great.  We signed up to a plan that allowed us to enter customer addresses and charge for shipping.  The change in Shopify plans means we now need to spend $2.3K a month to get the features in our old plan.  With out being able to add address the POS app is almost useless at trade shows.\nWe also found that we could email the cart to a customer as a quote.  We were using this feature regularly.  In a recent update this feature was removed, making the POS app totally useless now for small businesses.",
    "developerResponse": "",
    "version": "9.7.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Removing the price override functionality",
    "rating": 1,
    "date": "2023-09-29T19:00:58-07:00",
    "author": "Nooshi8719",
    "content": "Why was this removed, it was such a useful tool. Now we must use the calculator manually and deduct which just takes twice as long, i do not understand why it was removed. To make way? To make way for what. Ridiculous update with low IQ developers and design.",
    "developerResponse": "",
    "version": "8.18.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Printer Bug",
    "rating": 1,
    "date": "2023-09-07T14:08:38-07:00",
    "author": "Dj4bc",
    "content": "Since 8.16.2 my docket printers no longer print from any other software or devices. The POS app is trying to be helpful and auto detect printers, but it locks them out for other users. Very frustrating for my cafe which has had no dockets for a week!",
    "developerResponse": "",
    "version": "8.17.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Updated tracking WTD/MTD",
    "rating": 1,
    "date": "2023-05-27T03:31:18-07:00",
    "author": "crtjm",
    "content": "The latest updates took away the drop-down option on POS to track ‘yesterday’, ‘week to date’, ‘month to date’ statistics and its near impossible to react to trade now!",
    "developerResponse": "",
    "version": "8.9.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Updates are Frustrating",
    "rating": 1,
    "date": "2023-04-18T00:44:29-07:00",
    "author": "Araplam",
    "content": "The latest update is costing my business money!!!!!\nAs a subscriber of 2 locations per month this is not acceptable!\nWhilst it may a good idea to add the Customer Name or phone number in prior to adding shipping address, this may be ok if the items are being delivered to the customer address, this is not ok in our situation as a florist.  99.9% of our customers have their order delivered to someone other than themselves.  I had called support and they have told me that I should use a dummy customer name. The problem is at the point when we enter the dummy customer name (which is each of our store’s name) we need to wait for at least 45 sec before the system picks up the name and then prepopulates with the details.  Then we have to delete the details prepopulated and add in the correct recipient and their address.\n\nOur actual customers do not have time for us to “wait” each time and therefore, we have been forced to go back to hand writing the order on a form (going back to what we used to do prior to POS) and then go through the process of adding the sale and delivery information after we have finished with our customer.  This is all double handling and we are having to spend more money on wages!\n\nYour system is not very obliging for the amount of money we are already spending.  We are coming up to Mother’s Day where we have many orders to upload over a period of at least 2 weeks.  We cannot afford to have out staff handwriting the order and then spending more time entering the order into the system - we have gone backwards!!!\nWould love someone to contact me to discuss and have this fixed before the end of the month!!  Maria - 07 47716767 (Malpara Florist)",
    "developerResponse": "",
    "version": "8.7.0",
    "voteCount": 1,
    "voteSum": 1
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Wisepad 3 and your updates have made it worse!!",
    "rating": 1,
    "date": "2023-04-16T16:58:54-07:00",
    "author": "Glen.s8",
    "content": "Ever since the new update my wisepad3 will no longer accept automatic touch and go payments. I have to now manually enter cards. It's very annoying! \n\nPlus not only that, for it to actually connect. I have to turn my phone off, then the wisepad on, then turn my phone back on for it to connect. \n\nOtherwise it has so many issues. I see a lot of people complaining about the exact same thing, so please focus on that before adding more features.",
    "developerResponse": "",
    "version": "8.6.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Low grade POS riding on coat tails",
    "rating": 2,
    "date": "2022-10-28T05:56:50-07:00",
    "author": "WillD83",
    "content": "What integration?\n\nOutside of the US this is a useless app!",
    "developerResponse": "",
    "version": "7.11.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "WisePad3 is the most useless thing",
    "rating": 1,
    "date": "2022-08-08T21:59:09-07:00",
    "author": "Luke Bald 1992",
    "content": "WisePad3 in Australia is the most useless device ever. I wish I never switched from Square but I have to deal with it now. We spend 20 mins per day trying to connect the device. I have 3 of them and Shopify has sent me a replacement one for one of them. Nothing has changed. If you want to pay your staff $30 per hour to connect this device every day, go for it.",
    "developerResponse": "",
    "version": "7.5.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Update causing issues",
    "rating": 5,
    "date": "2022-05-30T19:26:47-07:00",
    "author": "Runway 87",
    "content": "I have just updated and since then my pos keeps locking up, needing to lodged in, won’t log in, and prints 3x receipts every time. I have done the adjustment’s suggested but we are still having issues",
    "developerResponse": "",
    "version": "7.0.2",
    "voteCount": 1,
    "voteSum": 1
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Won’t save PIN",
    "rating": 1,
    "date": "2022-04-22T00:58:02-07:00",
    "author": "Pat & Stu",
    "content": "Can’t get past the set PIN page. Won’t save, so can’t use the app at all.",
    "developerResponse": "",
    "version": "6.79.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Useless and overpriced by far",
    "rating": 1,
    "date": "2022-03-09T05:42:36-07:00",
    "author": "adam hates shopify",
    "content": "Do not buy this",
    "developerResponse": "",
    "version": "6.79.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "So easy",
    "rating": 5,
    "date": "2021-11-29T00:16:49-07:00",
    "author": "iamtess",
    "content": "This makes selling from anywhere possible. Easy to setup and use.",
    "developerResponse": "",
    "version": "6.69.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "New update thumbs down",
    "rating": 1,
    "date": "2021-10-26T21:04:50-07:00",
    "author": "StormageddonJess",
    "content": "The new update leaves a little bit to be desired. Grid view of products is gone along with side scrolling through grid view. Cannot find a way to get it back.",
    "developerResponse": "",
    "version": "6.66.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "App does not support EPSON receipt printer",
    "rating": 2,
    "date": "2021-08-08T22:38:33-07:00",
    "author": "Jenjen77777777",
    "content": "Buyer beware! \n\nThis app is good except, if you want to print reciepts, the EPSON model they have suggested DOES NOT CONNECT. \n\nNo one will help but they are “very concerned” and “someone will email you” I don’t know when but it hasn’t happened yet",
    "developerResponse": "",
    "version": "6.54.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Terrible Update",
    "rating": 1,
    "date": "2021-07-20T22:35:51-07:00",
    "author": "Whereeaglesdare79",
    "content": "The new layout is terrible, the functionality is gone, every process takes you to another screen. Was this made by someone who has never used a POS before? How do you go back to the old erosion without paying the ridiculous fees being charged. This is enough t make change from Shopify and I have been a customer for six years!",
    "developerResponse": "",
    "version": "6.52.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Not worth the cost on the pro plan",
    "rating": 1,
    "date": "2021-04-17T02:00:48-07:00",
    "author": "Ipod dreams",
    "content": "Run an Aussie business using Shopify. The pro pos plan is expensive to run in Australia. I will be switching to another product that has all the pos features a retail business need.",
    "developerResponse": "",
    "version": "6.40.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "POS",
    "rating": 1,
    "date": "2021-03-31T16:03:39-07:00",
    "author": "My Giirlfriend and I",
    "content": "I WISH YOU WOULD LEAVE THE WAY THE SCREEN LOOKS NOT JUST CHANGE IT.     I HATE THIS !!!!!!!",
    "developerResponse": "",
    "version": "6.37.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Very expensive",
    "rating": 1,
    "date": "2021-02-26T16:53:16-07:00",
    "author": "petertri",
    "content": "I used to love this app last year before there was a pro version for consideration. But now it just seems like a very very expensive POS app.  As many others have said prior, it’s extortion and I doubt that they will reduce the cost despite so many complaints. Fair is fair but I feel this is way overpriced. It really needs to be reduced by half at least....\nAdding further insult, the latest update has made my app sooo slow too so I’ll be on the lookout for a new system, especially if this price stays the same.\nYou guys are a business and it’s fine to make a fair profit but you guys got really greedy.",
    "developerResponse": "",
    "version": "6.32.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Very expensive",
    "rating": 3,
    "date": "2021-01-31T22:20:23-07:00",
    "author": "missgigiboutique",
    "content": "Really like the POS and all linked to the website but so expensive. I’ve never used the old version so can’t compare. I think they need to look at the costs. I’m paying over $150 aud per month then get hit with international transaction fees from the bank.",
    "developerResponse": "",
    "version": "6.29.0",
    "voteCount": 2,
    "voteSum": 1
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Getting Greedy",
    "rating": 2,
    "date": "2021-01-28T17:44:50-07:00",
    "author": "Macozarian",
    "content": "Agreed the changes to the pricing for POS is ridiculous and the other options available are looking much better again.\n\nCan’t even add missing/new products directly from the POS app anymore either now. Costs more has less features 👎",
    "developerResponse": "",
    "version": "6.28.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Bring back the old",
    "rating": 1,
    "date": "2021-01-11T20:32:16-07:00",
    "author": "bobrob612",
    "content": "I used to love shopify and spoke highly of the software for quite some time. Unfortunately within the past year with major updates like the barcode printer and pos software has left me searching for a new system to use. The new register app doesn’t even tell you how much you’ve earned for the day.",
    "developerResponse": "",
    "version": "6.27.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Shopify pos to slow",
    "rating": 1,
    "date": "2021-01-09T18:51:10-07:00",
    "author": "slotzcarz",
    "content": "To find your product, then try and enter it as a sale is too slow a process with the hardware compatible in Australia",
    "developerResponse": "",
    "version": "6.27.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Extortion",
    "rating": 1,
    "date": "2020-12-03T15:13:51-07:00",
    "author": "Bear1986",
    "content": "I used to love shopify. Over time I’ve realised I’ve invested so much time in to this system that I’ve made myself vulnerable to their ad-hoc changes and price hikes. You cannot trust that the features you have today will be there tomorrow. Or, if the features you need will be moved beyond a paywall that is more than 100% higher than your current costs. Basically, you can’t trust them to have your back. \n\nDon’t get this point of sale program if you’re a new business, small business, or start-up. Don’t get this system ESPECIALLY if you’re a single store brick-and-mortar. The basic features you need are not there (being able to save a cart or make an exchange). The basic features are behind the much more expensive tier of pricing. \n\nShopify leave out key functions and then advise you to purchase (subscribe) to third party apps to bring those functions in. So, the actual cost of a working system is FAR HIGHER THAN YOU THINK. \n\nJust, don’t do it.",
    "developerResponse": "",
    "version": "6.26.2",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Bad ratings",
    "rating": 1,
    "date": "2020-11-29T22:47:43-07:00",
    "author": "shop agent",
    "content": "Their new version is hopeless,makes everything more complicated \nTakes forever to find a product. Massive mistake to launch this useless product.",
    "developerResponse": "",
    "version": "6.26.2",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "What a rip off this is now. So unhappy",
    "rating": 2,
    "date": "2020-11-25T19:33:15-07:00",
    "author": "ckcybkt",
    "content": "Massivley disappointed in this new upgrade. Unless we fork put a small fortune each month x several locations, all the features we had previously have now been removed. We already pay a lot of money to shopify and now on top of that they want USD $90 per month, per location, to access the features we’ve already had for years? So unimpressed. Now is not the time to be doing something like this to merchants that were relying on the POS to keep our businesses running! The layout is also awful. Big thumbs DOWN from us!\nAnd in response to the comment left by Shopify, I think you guys are seriously out of touch with your customers. This basic LITE version doesn’t even have an ability to exchange?! For an instore POS system, you have to go through a crazy process of doing a refund, emailing the customer a gift card, waiting till that comes through on their phone (if they have it with them), using the gift card to credit the balance. Have you ever experienced that process yourselves in store as either a retailer or a consumer? It’s insane. \nThank you for the suggestion of contacting your support. I did that, and then waited 9 days for a response. If I could give this review negative stars I would do so!",
    "developerResponse": "",
    "version": "6.26.2",
    "voteCount": 1,
    "voteSum": 1
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "New pricing model is extortion",
    "rating": 1,
    "date": "2020-11-25T15:03:51-07:00",
    "author": "My Eyez are bleeding",
    "content": "The switch to the new pricing model for POS Pro/Lite is an absolute ripoff.\n\nEssential features that were present in the previous (free) POS are suddenly placed behind a forced upgrade and a steep paywall, right in the middle of some of the most challenging economic conditions we’ve ever seen.\n\nYou are effectively holding small businesses hostage with this change and we will be reporting this to the ACCC.\n\nYou should be ashamed of yourselves.",
    "developerResponse": "",
    "version": "6.26.2",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Very disappointing",
    "rating": 1,
    "date": "2020-11-20T17:00:59-07:00",
    "author": "kids streetwear",
    "content": "We have been using POS for years and now to access the same features we had you want us to pay $90 usd per location per month! Which is Absolutely crazy. Just add the ability to exchange items in the lite option would be helpful.",
    "developerResponse": "",
    "version": "6.26.2",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "ISSUES WITH NEW POS LITE ..not happy at all",
    "rating": 1,
    "date": "2020-11-17T00:05:36-07:00",
    "author": "natkarl",
    "content": "New POS LITE\n- can’t save multiple customer cart anymore \n- can’t do a quick exchange for customer in our shop .. coming in to busy time instore and ridiculous to only have refund option now as we only exchange \n- can’t do layby \n- already pay enough each month to then lose features we are use to and have to pay lots of $$$ \nTime to look elsewhere to get what I need for my small business unless we get the features back\nYOU CHARGED US FOR POS PRO !!! 😡 AND WE ONLY HAVE AND USE THE NEW AND AWFUL POS LITE as we can’t afford to pay you anymore than we already do \nFIX IT URGENTLY",
    "developerResponse": "",
    "version": "6.26.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "New POS upgrade needs work URGENTLY",
    "rating": 1,
    "date": "2020-11-06T02:01:34-07:00",
    "author": "Sarah atkins",
    "content": "I LOVED the previous Shopify pos app. \n\nIt HAD all the features we need. \n\nSince upgrading, I do not believe we should have to pay US $85/month just to be able to have the same functions and features as we had before. That’s roughly AU$125-$130 PER MONTH.   \n\nWe’re now missing the ability to: \n\n1.     Initiate a lay-by (partially paid order) \nThis is an enormous oversight and needs urgent attention. OR if the ability exists, some instruction on how to. \nURGENT ATTENTION REQUIRED. \n\n2.    Search for a partially paid order using the customer name, the process which makes the most sense. We now have to scroll through the list of orders (all orders) to see which ones are partially paid, it’s impossible. \nURGENT ATTENTION REQUIRED. \n\n3.    Staff pins? Trying to issue my staff a PIN number via admin as can’t work how to do it in POS app.  (they had one each before, 5 staff in total) and all I get is “Pin is already taken”. Plus I can’t see my staff listed in Shopify admin. \nAGAIN, URGENT ATTENTION REQUIRED. \n\n4.    The “add custom sale” tile takes you to a screen where it’s very easy to add the amount, BUT the design and layout really leads you to press the “+1” button rather than the “add to cart” button which seems quite hidden in the top right corner. \nURGENT ATTENTION REQUIRED. \n\n5.    Add to cart. Paying an extra $85 (US!) per month is an extreme extra cost for a feature that was previously included as standard. The technology has not changed for this feature. \nURGENT ATTENTION REQUIRED.  \n\n6.   Remove extra steps. Please, to be exact,  a fourth option in the bottom row toolbar, that is a simple “back to checkout” option. I should not have to press 5 buttons (at minimum) to get back to the cart page. It takes valuable time and is extremely frustrating. \nURGENT ATTENTION REQUIRED. \n\nSpeed and accuracy are the most important things to consider in a busy retail environment.\n\nThis upgrade has so much potential, but considering the above is clunky and does not consider the merchant in a retail environment at all. \n\nIf you’re going to upgrade and rebuild an app in complete usability and layout, then the existing services should still be available for the same subscription rate. We’re already paying for a system which now has LESS features, and your profit is going up, right? \n\nThese matters need urgent attention, as we are heading into the Christmas period and cannot afford more time and money spent for a system that worked perfectly well before the update. \n\nIt pains me to consider looking at other options than Shopify. I do not want to retrain my staff, or rebuild my store or POS system. \n\nPlease fix these issues as a matter of extreme urgency. \nIn the future when an upgrade is planned (BEFORE it is implemented) I strongly suggest deeper level merchant liaison and feedback, and restructure based on this feedback. \n\nStill a Shopify fan, just not a happy one at the moment. \nAs previously mentioned, the above mentioned matters were already standard prior to the upgrade. \n\nIsn’t Shopify as a corporation making enough money from subscriptions and Addons and percentages of online sales, without adding on the massive new POS fees just for the same features we had?\n\nPlease work these UX issues out as a matter of urgency, or my money (your profit) walks.",
    "developerResponse": "",
    "version": "6.25.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Unhappy with new Look",
    "rating": 1,
    "date": "2020-11-02T12:50:31-07:00",
    "author": "Toddy.B",
    "content": "Very unhappy with the new layout and look, bring back the ability to save a cart",
    "developerResponse": "",
    "version": "6.25.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Shopify have done it",
    "rating": 5,
    "date": "2020-11-01T20:54:31-07:00",
    "author": "hasan27",
    "content": "Incredibly stable. Has increased our closure rate significantly. Reduces staff and warehouse Costs. Streamlines internal logistics for local deliveries. Increases margin with more relevant product info at fingertips. So intuitive. Flexible. Fast. Easy. Reinvigorates sales teams. Thanks Shopify. The platform to end all platforms.",
    "developerResponse": "",
    "version": "6.25.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Terrible",
    "rating": 1,
    "date": "2020-10-27T23:05:35-07:00",
    "author": "tfhmcghmchgchg",
    "content": "The search features are woeful. You can customise categories but no search feature? Redic",
    "developerResponse": "",
    "version": "6.24.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Need after pay integration",
    "rating": 2,
    "date": "2020-08-11T19:49:02-07:00",
    "author": "Dollarmites",
    "content": "Waste of time if we can’t accept afterpay",
    "developerResponse": "",
    "version": "6.13.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "what a joke",
    "rating": 1,
    "date": "2020-07-12T03:42:01-07:00",
    "author": "RetailB",
    "content": "If could only give minus stars!!!!!\nWaste of time and energy!\nVery frustrating! dont live up to the hype! \n\nIm only talking about performance in AU\nOne note... if your not fully ready to roll out in AU DON’T !\nno payment intergration! for a busy store this is a must! manual payment processing is dangerous since it can cause errors! \n\nmpop intergrations dont work.\nAfter trying thousand times to print receipt and scan barcodes!!!!\nSupport told us mpop dont work in AU!\n\nExcuse me.... but it is jn recomended hardware.\n\nin summary very disapointed!",
    "developerResponse": "",
    "version": "6.9.1",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Very disappointing",
    "rating": 1,
    "date": "2020-05-28T16:17:19-07:00",
    "author": "Lemmons Store",
    "content": "We have used the previous version for a few years, it isn’t perfect but you can do what you need. The new version is very average, has all these new features that are supposed to make it great but hasn’t addressed any of the previous things that needed fixing. Now it is going to cost much more. Basic functions like scanning products are very glitchy, sometimes work easily sometimes don’t work at all with the scanner we have used for over 2 years. Very average product for the price now, would be fine if your needs were very basic, if you have products with lots of variants, customer accounts, accept appro’s & returns, need accounts to sub total for customer payments, find one that at least you get the features you need for the money.",
    "developerResponse": "",
    "version": "6.3.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Basics covered. Not yet ready for Australia",
    "rating": 2,
    "date": "2019-07-23T04:30:04-07:00",
    "author": "Tobias G",
    "content": "Good overall POS with some decent features. \nSimple features missing though such as cash rounding, fulfilment at POS, TYRO integration (or other EFTPOS terminal), and global sales holds. \nHaving a diverse range of apps to select from is ok, but some basics could be covered out of the box such as the ability to process/retrieve a saved draft order via POS rather than having to pay for an app to be able to do this.",
    "developerResponse": "",
    "version": "5.33.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Love it!",
    "rating": 2,
    "date": "2019-07-18T15:53:18-07:00",
    "author": "LJR.AU",
    "content": "We use POS for our pop up shops through Australia and its been nothing but amazing. \nThe only thing that could make it better is barcode password for staff instead of numbers.",
    "developerResponse": "",
    "version": "5.32.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Keeps crashing",
    "rating": 1,
    "date": "2019-06-25T20:46:13-07:00",
    "author": "sall00",
    "content": "New update keeps crashing. Disappointing.",
    "developerResponse": "",
    "version": "5.29.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Garbage",
    "rating": 1,
    "date": "2019-05-10T03:22:12-07:00",
    "author": "Allsdeapps",
    "content": "What is up with Shopify and making the most useless software where you need 1000 apps to get anything done properly.",
    "developerResponse": "",
    "version": "5.22",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Requires some development still",
    "rating": 2,
    "date": "2018-11-07T14:53:58-07:00",
    "author": "Lachlan7",
    "content": "Shopify POS is sluggish when processing transactions. We have download internet speed of over 100mbps yet the pos takes a long time to process (compared to square).\nIn Australia our staff would like to see:\n- Integrated with payment eftpos terminals such as tyro\n- Fast transaction button to quickly take cash/card. There are too many buttons/pages to press in one transaction. Especially when you try square and their system is so quick and easy!\n- Drag and drop products on the homescreen instead of them listed in alphabetical order\n- Staff login needs improving. The pin system isn’t efficient as with multi sites and huge staff, pin codes are taken and easy to use another persons login\n\nFor the money you pay for POS being $50 usd per month, you would expect a better faster, easy pos system.",
    "developerResponse": "",
    "version": "5.2.2",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Great app but found a Bug",
    "rating": 4,
    "date": "2018-09-26T21:50:07-07:00",
    "author": "IvanXSH",
    "content": "Great App after adding the multiple location inventory function.\n\nFound a bug: Cannot choosing collections when iPad ‘Guided Access’ function started.\n\nThanks",
    "developerResponse": "",
    "version": "5.1.0",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Won’t load",
    "rating": 1,
    "date": "2018-09-07T03:50:00-07:00",
    "author": "Bluebirdfreebird",
    "content": "Won’t import my store, continually asks to retry and still won’t load store even after reinstall. Might have to change back to my wix store so I can use POS at markets again instead of losing sales",
    "developerResponse": "",
    "version": "5.0.2",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "It’s ok",
    "rating": 2,
    "date": "2018-07-19T10:20:09-07:00",
    "author": "Diluxdi",
    "content": "Would love the ability to import customer details from stored phone records and to take part payments on invoices. Good but could be awesome with some work",
    "developerResponse": "",
    "version": "4.8",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "New to Shopify",
    "rating": 3,
    "date": "2018-07-18T14:34:45-07:00",
    "author": "dollwise",
    "content": "I love the functionality of this system and how intuitive it is. It would be so much better if I could add the wholesale cost of an item to the backend. This would make stocktake so much easier and end of financial year reports a breeze. Please consider adding this to further enhancements.",
    "developerResponse": "",
    "version": "4.7.6",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "4 years, still no cash rounding",
    "rating": 1,
    "date": "2018-04-18T06:12:29-07:00",
    "author": "DylMusicMan",
    "content": "Been using Shopify for almost 4 years but have encountered non-stop accounting workload since opening a physical store in 2016, all because this app STILL doesn’t have cash rounding. Every time I ask, I get told “it’s on the roadmap”. Oh well. At least I’m moving my business to an app that works.",
    "developerResponse": "",
    "version": "4.5",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Great app, except missing one big business criteria.",
    "rating": 4,
    "date": "2018-02-20T16:26:33-07:00",
    "author": "Mcintyreslady",
    "content": "Have been enjoying the App and how organized I can keep my sales and inventory. I love the instant receipts to my customers.  My only issue is I have no way to enter my costs and get reports on profits from my sales. This would be ideal.",
    "developerResponse": "",
    "version": "4.3",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "So handy for market businesses",
    "rating": 4,
    "date": "2017-12-09T17:50:42-07:00",
    "author": "Brinno",
    "content": "We use this app to track sales at our market. It's great because it keeps our stock up to date on the website instantly. Easy to use and immediately updates in Shopify reports etc.\n\nTwo requests:\n\n1) can you create a location prompt when opening the app (at least at start of day), I have staff that forget to swap locations and then the reports don't match. \nOr a way to change location in order if it's entered incorrectly?\n\n2)when is the Shopify POS payments mobile swipe machine going to be available in Australia?\n\nThank you.",
    "developerResponse": "",
    "version": "4.1.5",
    "voteCount": 1,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "It's ok",
    "rating": 3,
    "date": "2017-06-03T20:52:45-07:00",
    "author": "Yolo Aussie",
    "content": "Would be nice to link with credit cards for payments .",
    "developerResponse": "",
    "version": "3.12.2",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Ms",
    "rating": 5,
    "date": "2016-03-31T23:50:05-07:00",
    "author": "Bhoem",
    "content": "Love this app, I'm in Australia and use an external eftpos provider.",
    "developerResponse": "",
    "version": "3.6.6",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Can't accept payments without card reader",
    "rating": 1,
    "date": "2016-03-31T02:41:51-07:00",
    "author": "Meowyyyy12344",
    "content": "Not worth it- doesn't work with Australian businesses",
    "developerResponse": "",
    "version": "3.6.6",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Mr",
    "rating": 1,
    "date": "2016-01-12T17:34:07-07:00",
    "author": "Adtyh",
    "content": "Horrible- freezes constantly and needs rest all the time. Get it fixed",
    "developerResponse": "",
    "version": "3.6",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Orders tab not suitable for multiple locations",
    "rating": 1,
    "date": "2014-10-09T05:08:26-07:00",
    "author": "Hannahgorg",
    "content": "This app has one major flaw for companies that have more than one physical location.\n\nCurrently if a sale is made in \"store 1\" the staff in \"store 2\" can see the sale in the \"orders\" tab. In fact they can see every sale your entire business makes. I do not want my staff to know my turnover figures. It can also discourage staff from trying if they can see another store is hitting the targets for them.\n\nPerhaps a \"show only orders from this ipad\" in the location setting. Or an option to limit the \"POS only\" staff to only seeing orders from the iPads location.",
    "developerResponse": "",
    "version": "2.1.2",
    "voteCount": 0,
    "voteSum": 0
  },
  {
    "app": "Shopify POS",
    "store": "App Store",
    "title": "Fantastic worked straight away",
    "rating": 5,
    "date": "2013-09-11T19:42:21-07:00",
    "author": "Rweetbix",
    "content": "This is a great app, easy to setup and use.  It'll be great when Laybys are allowed.",
    "developerResponse": "",
    "version": "1.0.3",
    "voteCount": 0,
    "voteSum": 0
  }
]