[
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Russ Gardiner",
    "rating": 3,
    "date": "May 28, 2025",
    "content": "ok overall, but a little bit clunky to use. biggest complaint is the \"delete cart\" button. it's in the exact same place as the \"save\" button when you're pricing a discount. the number of times I've deleted an entire cart after a few minutes setting it up is insane. Add a delete confirmation button!!! I would also love for an option that I can turn on that will prompt to add a customer to the sale (if you haven't yet) when you go to accept payment. I get talking and forget and it screws me",
    "helpfulCount": 91,
    "developerResponse": "Thank you for your feedback. We understand the frustration with the 'delete cart' button placement and the need for a delete confirmation. Your suggestion for a prompt to add a customer before payment is valuable. We'll pass this on to our team for consideration. If you need further assistance, please visit help.shopify.com/support."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Christina Trexler",
    "rating": 1,
    "date": "May 7, 2025",
    "content": "recent update slows everything down and adds extra screens. It used to be upon checkout you could tap a credit card without having to select anything else. now you have to select 'credit card' before you can run the card. I don't know why they went backwards with this change. also the whole app is running more slowly after the last update",
    "helpfulCount": 226,
    "developerResponse": "Thank you for your feedback. We understand the recent update has added extra steps and affected performance. We're continuously working to improve the app experience and appreciate your patience. If you have further concerns, please reach out to our support team at help.shopify.com/support."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Matthew Onassis",
    "rating": 1,
    "date": "December 25, 2025",
    "content": "Absolute Garbage app. It's literally POS! Sometimes it takes 1-2 minutes for the app to load on a 500 mbps internet. It keeps saying connection failed. 90% of the time products won't load on thr app. You gotta keep closing and opening it to load them and the app to accept payments. Can you imagine you're selling your products on the go, and your customers have to wait 5 minutes to load your POS for them? Do better, Shopify! Stop outsourcing everything to third world countries.",
    "helpfulCount": 9,
    "developerResponse": "We understand the frustration with the app's performance. Please ensure your app is updated to the latest version. If issues persist, contact our support team at help.shopify.com/support for further assistance. We appreciate your patience as we work to improve your experience."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Tommer Kahan",
    "rating": 3,
    "date": "February 18, 2026",
    "content": "I've used it on both Android and iOS, phones and tablets, for a few months now. Shopify clearly is focused on its ecommerce product (which is great), leaving the POS quite neglected. No at store pickup scheduling, no built-in tickets, very sluggish when connected to the payments terminal (yes, fully updated), no built-in modifiers (like pizza toppings or supersizing), generally bad UI (unnecessarily huge item button). Square was better. This is not a POS, it's make believe.",
    "helpfulCount": 0,
    "developerResponse": "Thank you for your feedback. We understand the importance of a seamless POS experience and are continuously working to improve our features. Your insights on store pickup scheduling, built-in tickets, and modifiers are valuable. Feel free to reach out to our support for further assistance with the POS Terminal, and we're happy to help."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "David Blatch",
    "rating": 1,
    "date": "December 24, 2025",
    "content": "So slow, not worth using. By the time the app has warmed up and reconnected to our Wisepad, which it has to do on a regular basis throughout the day, our customers have either left or are getting edgy and wanting to leave. Bad for business, makes us look unprofessional. If our entire site wasn't based on Shopify, I would look for an alternative.",
    "helpfulCount": 2,
    "developerResponse": "We understand the importance of a seamless experience and apologize for the inconvenience. Please ensure your app is updated to the latest version. If the issue persists, contact our support team at help.shopify.com/support for further assistance. We appreciate your feedback and are here to help."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Rosie Marshall-Wilks",
    "rating": 1,
    "date": "February 6, 2026",
    "content": "urgh. seriously fix the android app. ive updated the app but yet still says \"update required\" nope it doesnt. ive also been having issues with the card reader staying connected, even though it says its connected.",
    "helpfulCount": 0,
    "developerResponse": "We understand you're experiencing issues with the update prompt and card reader connectivity. Please try reinstalling the app and ensure your device's software is up-to-date. If the problem persists, contact our support team at help.shopify.com/support for further assistance."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Sonya Beeler",
    "rating": 2,
    "date": "January 4, 2026",
    "content": "I do not like that I had to add a pin the phone to use this app.. find a way to secure the app without effecting my over all phone usage",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Oviex",
    "rating": 1,
    "date": "February 7, 2026",
    "content": "do not work any more keep telling me to update to the last version and I have the last version and still don't work no more.",
    "helpfulCount": 0,
    "developerResponse": "It seems like you're experiencing issues with the app update. Please try reinstalling the app to see if that resolves the problem. If the issue persists, reach out to our support team at help.shopify.com/support for further assistance."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Christo Botha",
    "rating": 1,
    "date": "February 19, 2026",
    "content": "Why remove the warning and user acknowledgement the item they are trying to sell on the POS has been sold on a different channel and there is no stock?",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Rhiannon Kirby",
    "rating": 1,
    "date": "February 4, 2026",
    "content": "why would you kick a newer android off the tap to phone but a 12 yr old apple works wth... and no help to fix it but a new customer can get a free reader?",
    "helpfulCount": 0,
    "developerResponse": "We understand your frustration with the device compatibility issue. Our team is continuously working to improve device support. Please reach out to our support team at help.shopify.com/support for further assistance. We appreciate your patience and feedback."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Austin Lehmann",
    "rating": 5,
    "date": "December 17, 2025",
    "content": "What a great app! It's a little slow BUT so convenient and its very well organized",
    "helpfulCount": 17,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Sassy Sparkles 5 Jewelry",
    "rating": 3,
    "date": "March 27, 2024",
    "content": "I was happy with the app on my tablet. Now it shows that it updated the software. I am disappointed that the \"save cart\" feature was removed. Now it says \" save as draft\", but you need to have the paid version of Shopify Point Of Sale. This has disrupted my selling because I sometimes get payments at the end of the day, and it does not allow me to save and recall an order. Is there a way to revert to the previous version. I liked it better.",
    "helpfulCount": 52,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Daniel Barnett",
    "rating": 1,
    "date": "March 4, 2024",
    "content": "Very poor. Images of products do not load. Occasionally they do but 90% of the time they just don't. This is on the free version so now way we're paying for the full version! Plus have to type in pin every time you want to use, even though on my already secured phone, which causes a long delay when you really just want to serve the customer. Utter trash of an app. Can put sales though once searched for each-individual-product-slowly. Sometimes receipts don't print either! Happy to revise review",
    "helpfulCount": 36,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Natalie Parker",
    "rating": 1,
    "date": "April 27, 2024",
    "content": "I was using this at an event today, and when I go to checkout with a card, the app keeps telling me to wake up my reader. Then the app closes itself out, and I get a notification that it's crashed. I have to then try again, and MAYBE IT will work this time, which honestly takes a few more times of crashing to work. I eventually got frustrated and used my square app, which takes credit cards faster, and I don't need an extra device as I can use my phone as a tap.",
    "helpfulCount": 86,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Yana Dee Store Team",
    "rating": 3,
    "date": "May 15, 2024",
    "content": "The recent update in mid May 2024 was for the worse. Clicking on a variant no longer adds it to the active cart. The whole purpose of this app is to add items to the cart to sell them. I don't want to look at every picture and stat of the item, I want to add it to the cart and sell it. If I wanted an in-depth analysis of the product, I would go to the Shopify app or better yet my computer. PLEASE CHANGE IT BACK!",
    "helpfulCount": 36,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "A Google user",
    "rating": 3,
    "date": "March 14, 2019",
    "content": "once set up, it's been s great app. they will ask for more information after a while, and held my money (about 10k) for a month while I submitted a copy of my id multiple times. this really impacted my ability to pay bills for my business. I even stayed on the line with them while I scanned and emailed it in. so, it works, but customer service is poor.",
    "helpfulCount": 42,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Bijan Soularie",
    "rating": 2,
    "date": "November 15, 2024",
    "content": "Nice app with potential...and I'm saying this after using the app for several years. I wouldn't have to say that if it weren't for recent updates. Like the one with the customer choosing their receipt type. My register is not set up in a way that allows that, so now it just slows me down. Please make it so I can toggle that option on or off. I'm already tired to having to keep pressing extra buttons just to tender a sale. Also, sometimes a CASH transaction will say PAYMENT DECLINED.",
    "helpfulCount": 12,
    "developerResponse": "Hello Bijan, thank you for your review. The receipt selection option can be disabled in your Shopify Admin under Point of Sale > Settings > Customer receipt selection. If you are still experiencing issues with this or with cash transactions declining, please contact us through our Help Center at help.shopify.com, and we would be happy to assist."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Ashley Ledgerwood",
    "rating": 1,
    "date": "June 22, 2021",
    "content": "The new app is terrible! it is so slow! It kicks you out when your in the middle of serving someone. It takes forever to bring up the products you are searching for. And once you click on it it takes you back to the start, but I have variants of products so its such a pain that I have to look it up again to click a different one! Hate the new version, the old app was so much better!",
    "helpfulCount": 28,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Stefanie Walls",
    "rating": 2,
    "date": "May 12, 2021",
    "content": "I had the \"pleasure\" of beta testing this app. I have been waiting 5 years for an android friendly POS from shopify. I consistently get told I'm not connected to the internet. Payment transactions freeze and I was given zero guidance on hardware capabilities. I would love to add the receipt printer and barcode scanner, but no one can tell me if they are compatible. The tiles are very confusing, too. Some are grayed out and won't let me use them. I hope the developers are taking all the feedback and making adjustments.",
    "helpfulCount": 32,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "E H",
    "rating": 1,
    "date": "November 13, 2023",
    "content": "If I had a choice, I would not be using this system as a POS. Very Very slow on everything I do scanning on products, searching for products and cashing people out. The lock screen keep freezing up on me and can't get into system. I went to buy a new tablet thinking it was my old tablet problem but that is not the case. it is the app itself. I have message support team and hopefully they can figure out the problem.",
    "helpfulCount": 9,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Holly Walker",
    "rating": 2,
    "date": "August 4, 2021",
    "content": "I'll start by saying that I love Shopify. But, I want the old app back! This app is slow and hard to navigate. Also, I have card reader issues on every Shopify app on every devise. It will never stay connected and eventually the card reader dies completely, but Shopify support will not claim it is a hardware issue. It is very frustrating. I just want the old card reader that plugs in to the phone back.",
    "helpfulCount": 74,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Paul Lindsay",
    "rating": 1,
    "date": "April 29, 2022",
    "content": "It just doesn't work properly! We've been battling with the app for a few months, support tried to help but the last time they asked for all sorts of detail and screen videos, we gave up. We've had problems with search and connecting to hardware mainly. Support asked us to make sure we were on Android 12, our fairly new £175 tab isn't on it yet, and there are only a couple of high end tabs on Android 12 on the market so far as we can see. Today I bought a second hand £160 iPad 6 and downloaded the app from the Apple store and everything works! It's amazing, really fast, hooks up to our card reader instantly and search finds results right away. It's a completely different experience. I'm guessing if you are reading this you are installing on Android. My advice is don't bother, buy the most recent iPad you can justify and save yourself a load of grief. When the Android version is as good as the Apple version it will be amazing. Hopefully that will be soon and I won't have wasted money on an Android tablet.",
    "helpfulCount": 35,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Jordan Hewlett",
    "rating": 3,
    "date": "November 26, 2025",
    "content": "Simple but slow. does it job but the loading time just opening the app is frustrating when trying to make a sale.",
    "helpfulCount": 3,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "frange",
    "rating": 1,
    "date": "September 17, 2022",
    "content": "I don't usually write reviews but I will do an exception for this app. This app is junk, I have a chip and swipe reader. It was working fine before, and today I am at an event and the card reader is not working anymore. It shows that it's connected but when I go to the checkout only manual entry is available for the reader. I spent hours trying to troubleshoot at no avail. I even reinstalled the app. I am so frustrated now. I am going back to square app from now on. You guys need to do better.",
    "helpfulCount": 71,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Amanda",
    "rating": 1,
    "date": "May 13, 2022",
    "content": "Not good for craft shows, markets, or pop-ups. There is no option to update the location for collecting sales tax. The suggestion I was given was to create a different location and transfer all of my products over into this new location then change the address for that temporary location every time I do a pop up which is 9 out of 12 months of the year. All over my state. This is clunky. Other POS systems that I've used in the past have a simple option to type in the the tax rate for the day.",
    "helpfulCount": 84,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Mikang Z",
    "rating": 2,
    "date": "September 1, 2022",
    "content": "Reciently the POS till has been crashing almost everyday. Right as you check out, the chipreader either does not connect well and it just gets stuck on payment method page. You then have to restart the app and restore the transaction. Then it will get stuck on the payment processing page. So you restart the app again. Repeat again with all customers. This has been the case for the last week or two. Connectivity issues always. Chip and tap pairing fails too. 😞 reallywishing for an older version.",
    "helpfulCount": 49,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Jessie",
    "rating": 1,
    "date": "July 26, 2021",
    "content": "7/26/21 update: Shopify continues to tell me it's a hardware problem and I've done more hours of troubleshooting. They sent me a new card reader that also doesn't work. Now they want to send me another card reader. Is anyone else having the same experience? 721/21 update: I'm continuing to jump through troubleshooting hoops with Shopify support. Now Shopify is claiming my card reader must be defective. That doesn't even address all the other issues I'm having. Shopify, please go back to the previous app version or allow users to decide which version they want to run. This new one is terrible. The update is awful. It's absolutely crippling my ability to use this as a POS. Very unhappy. Fyi, I am running the latest version of the app.",
    "helpfulCount": 64,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Bob Johnson",
    "rating": 1,
    "date": "September 4, 2021",
    "content": "Bells, whistles, bugs, and connectivity problems. Chip reader and swipe will drio out, and not reconnect. Only fix is to forget reader, restart device, and start over. Hardly a good option when you are trying to process orders at a high traffic craft fair. Please bring back the old app. It was perfect for pop up shows and fairs. Keep this one for those that need the extras, and re-release the old one as \"Shopify POS Lite\".",
    "helpfulCount": 38,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Meiliana Sintaraga",
    "rating": 1,
    "date": "July 24, 2021",
    "content": "I've been a Shopify client for a long time, and I've never encountered this type of problem with the older version...EVER! Hey tech support, can you please do something about the constant log out and the pin request? I saw that you posted something about the \"settings->account->Shopify,etc. DOES. NOT. WORK!!!! EMAIL ME!!!! I have a shop to run & your POS is literally a POS!",
    "helpfulCount": 8,
    "developerResponse": "Hi Meiliana! Thank you so much for your feedback. The app's Screen Lock period can be adjusted by navigating to the POS app > ☰ > Settings > Screen lock. While our Support team isn't able to send outbound emails, they can be reached via shopify.com/contact if you need any assistance with this and we'd be happy to help."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Allie Marini",
    "rating": 4,
    "date": "November 27, 2024",
    "content": "Issue resolved. The tap to pay chip reader was not always reliable at events where the WiFi was not strong or being used by a lot of people. Once I changed to use my phone as the tap reader, it wasn't an issue anymore, and the chip reader was able to read the few cards that didn't have a tap chip. If you're working at an event, I suggest making your phone your primary and/or adding a mobile hotspot to boost your chip readers' functionality.",
    "helpfulCount": 66,
    "developerResponse": "Hi Allie, thanks for sharing your feedback with us. If you're still having trouble, please contact our Retail Support team at help.shopify.com for troubleshooting assistance. We know how important it is for your POS to work reliably, especially at events, and are available 24/7 to assist anytime. - Caroline, Shopify Support"
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Donabate Dexter",
    "rating": 2,
    "date": "October 14, 2020",
    "content": "Bought 2 card readers, neither connect. Both shopify hardware. In Ireland. *update...seller of pos card readers will accept a return of products. The fact that you cannot use this product with android needs to be very clear. Alot if hassle could have been avoided. The shopify app itself is good. Just don't get the card reader if you use android.",
    "helpfulCount": 18,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Hedonist",
    "rating": 1,
    "date": "September 22, 2025",
    "content": "APP UI IS TOO SLOW AND BUGGED TO BEGIN WITH, THEN THEY MAKE YOU REGISTER BEFORE YOU CAN EVEN TRY THE APP ONLY TO BAIT YOU AFTERWARDS WITH A TRIAL PERIOD, GOOGLE SHOULD BAN SUCH APPS THAT DON'T EVEN STATE THEY HAVE IN-APP PURCHASES, I AM REPORTING THIS APP FOR SCAM! 🤮",
    "helpfulCount": 7,
    "developerResponse": "We appreciate your feedback and understand your concerns about the app's performance and registration process. We're continuously working to improve the user experience. For any issues or feedback, please reach out to our support team at help.shopify.com/support. Thank you for your patience."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Warren manning",
    "rating": 2,
    "date": "October 14, 2023",
    "content": "After the last update to the tap & chip card reader. My reader has been unable to process chip cards. It says processing payment and gets stuck on that screen. There is no longer a point in the transaction that tells us to remove the card. And it no longer gets to the point where it says completing transaction. A total refresh is needed to get back to use the app. This is not a hardware problem as all 4 of my tap & chip reader are doing the same. 2 are brand new. Pls fix this massive bug!!!",
    "helpfulCount": 42,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Carmela Frigand",
    "rating": 5,
    "date": "January 11, 2026",
    "content": "it's great! but you shop with a third party to a third party and I got a bill and I didn't know what it was from and it was from a third party on Shopify and I found out it was from a firm that I owed them $14 it was a month behind. I didn't know it. I didn't know that I was on a third party when I ordered the merchandise. 0 so you're dealing with a third party consumer? And you don't know who's giving you the credit",
    "helpfulCount": 10,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Mark J",
    "rating": 2,
    "date": "November 20, 2023",
    "content": "Slower interface than expected since transitioning from Square. When you click on one of your collections, sometimes it takes a second or more to load your items. Moreover, there is no way to disable receipt options from the customer facing POS Go. This is an efficiency killer for retail shops and needs to be fixed. I print receipts automatically, so there is no need for the customer to select anything post-sale. Also, why is everything so big? There should be a way to adjust to reduce scrolling",
    "helpfulCount": 36,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Kaytlon Everitt",
    "rating": 1,
    "date": "May 23, 2021",
    "content": "May 2021 update is awful and buggy. I keep having to restart my entire device, issues with card reader pairing, active items in store will show up for one transaction then not pull up for the next transaction, customers transactions timing out when swiping, tapping, apple pay, and even manual entry. There is only one improvement- exchanges seems to be made easier. Everything else about it is a hot mess embarrassing to deal with when you have a line of customers.",
    "helpfulCount": 24,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Arun Das (ADTC Rulez)",
    "rating": 2,
    "date": "November 11, 2020",
    "content": "Ridiculous that the app opens with a Big and Bold \"Get Started\" button that misleads users to create a new store when they are more likely to want to log in to an existing one. The Login link is in a hardly visible text below the button. Please change this so that it's the other way around, with a big prominent \"Log in to your store\" button, and then the link below to say \"Don't have a store yet? Create one\".. please think, most would want to login to a store they already have, not create new!",
    "helpfulCount": 33,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Bonny Durbin",
    "rating": 1,
    "date": "April 4, 2024",
    "content": "I constantly have connecting issues with the hardware and while using it with customers, you cannot enter amounts with descriptions only, but must select each inventory item. It takes too long to do that and then have connecting issues on top of this. NOT Good! I get very angry customers for having to wait and then worry if their card has been charged for tapping so many times!",
    "helpfulCount": 24,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Michelle Burkel-Ammerman",
    "rating": 1,
    "date": "February 7, 2022",
    "content": "Its quite embarrassing when you're at a show and your POS doesn't work. So yes POS is correct. You should have left it the way it was. I'm at my last with this NEW AND IMPROVED app!! None of my products come up. It takes forever to load. It doesn't read my chip reader... the list goes on and on!! Clear your cache they say. Restart your phone they say. Uninstall and reinstall they say. I'm about to change providers if y'all don't fix this!!",
    "helpfulCount": 27,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "CHEF ANTHONY MIAMI",
    "rating": 5,
    "date": "September 9, 2025",
    "content": "⭐️⭐️⭐️⭐️⭐️ Keith went above and beyond to help me with my Shopify account. He was patient, professional, and explained everything in a way that made the process easy to understand. I truly appreciate his support and highly recommend working with him if you need help!",
    "helpfulCount": 75,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "A Google user",
    "rating": 1,
    "date": "May 14, 2019",
    "content": "This app consistently is not in sync with our actual inventory. Hundreds of products that are in our inventory do not scan properly, wasting time when we have to manually remove a product after checkout. Their service team is inept at actually figuring out issues. They offer apologies and not solutions. This is a small business' worst nightmare.",
    "helpfulCount": 9,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Jakob Hendrikx",
    "rating": 1,
    "date": "February 16, 2024",
    "content": "This is the worst pos I've ever touched. Every time I look at it something else is wrong. Products lose their names only in the pos, the items won't place into carts, putting in a pin to log in leaves you staring at the pin login screen unmoving. It's garbage. Edit: I'm returning after a year and a bit. It's still terrible. The same problems persist. The website itself is a horrible thing. Do not use this garbage",
    "helpfulCount": 16,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Ozair Qadir",
    "rating": 1,
    "date": "October 19, 2025",
    "content": "Recently the POS app has not been functioning properly. I want to add products to order but the products don't show up on search.",
    "helpfulCount": 2,
    "developerResponse": "We're sorry to hear you're experiencing issues with the POS app. Please ensure your app is updated to the latest version. If the problem persists, contact our support team at help.shopify.com/support for further assistance. We're here to help!"
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Joseph & Lashanda Lewis",
    "rating": 2,
    "date": "June 27, 2021",
    "content": "We were excited about the update and the use of our card readers to make shopping simple with our brand, however we've encountered the following difficulties. - Card reader does not connect or fails to stay connected. - delayed transactions (big issue) causing us to restart the app and restore checkout. Even cash transactions get delayed. - repeat customers information does not populate for faster checkout. - Apple pay doesn't work We hope these issues can be resolved",
    "helpfulCount": 9,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Gregory Spear",
    "rating": 5,
    "date": "April 1, 2021",
    "content": "Completely scalable from kitchen table operation to mega international business. I picked it after an extensive search because of this scalability and the very low cost for entry. Thousands of apps in it's app store to help you customize it for your particular purpose and if those aren't enough, it's fully customizable by pros you can hire all over the world. It's hosted, so be sure to get a backup app.",
    "helpfulCount": 327,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Amy Vickers",
    "rating": 1,
    "date": "February 20, 2022",
    "content": "This app just sits on the loading page during setup for an hour and then crashes. Tried Uninstalling and reinstalling several times over 2 days while trying to set it up. Using Android. Really wanted to have an easy way to sell items in person from my Shopify store. There's no way to even contact support because it literally sits on a loading page and does nothing else.",
    "helpfulCount": 35,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Sacrament Fashion",
    "rating": 1,
    "date": "April 11, 2024",
    "content": "Awful, overpriced, and can I had multiple fraud charges due to the POS. None have been fixed and si m ce I refuse to renew my acct cst service or the lack thereof won't solve any of the issues that are 4 to 5 months old. I made over 400$ in sales and have yet to see one deposit. Small businesses don't use it. OWNBASE is just as awful and it's one of their main apps for TikTok. It messes up inventory which heavily affects the POS and the orders flowing in.",
    "helpfulCount": 2,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Shallette Del Rosario",
    "rating": 3,
    "date": "June 12, 2020",
    "content": "Please fix search engine.. If I type 2 words it won't show unless I type it exactly how it's on shopify.. example: if item is \"Table Top\" it won't show if I typed in a different way like \"Top Table\" it would be nice as well if we could search words from item description.. SKU should also show up on code scanning.. we have QR codes on SKUs and it doesn't show upon scanning.. scanning only applies on barcodes apparently..",
    "helpfulCount": 20,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Aileen Torres",
    "rating": 1,
    "date": "August 7, 2021",
    "content": "Terribly difficult to use and inflexible. Can only use Shopify Payments to use the tap and chip card readers. Otherwise you have to process credit card payments outside of Shopify. Functionality works differently on IOS and Android. Tap card reader doesn't wake up on Android. I have been told that I couldn't process credit card payments thru a 3rd party cc gateway, but somehow was able to process a manual cc payment on Android. The option didn't even show for IOS.",
    "helpfulCount": 8,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "zeldamaniac44",
    "rating": 1,
    "date": "February 10, 2024",
    "content": "Hi, there. I'm sorry to hear you did not have an ideal experience using the Point of Sale app. Our team would like to better understand your issue and ensure you're able to receive support. I recommend replying to your existing support ticket, or you can connect with us here: https://shopify.link/vRnL. -Victoria, Shopify Support.",
    "helpfulCount": 3,
    "developerResponse": "NEVER TRUST SHOPIFY, If I could give them negative -5 stars, I would. Signed up and did my first test transaction. They said it would take a few days (to deposit) it's been over three months, and I STILL don't have my funds (good thing I have another PoS processor. Opened a dozen support tickets so far!!! They promise a lot, but they don't deliver anything valuable, don't even have a phone number, just chat support outsourced to a team that won't/can't help."
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Kate Cascone",
    "rating": 1,
    "date": "May 10, 2021",
    "content": "This program has so many bugs. I currently do not recommend. Tap and Chip Card readers take all my staff Apple and Droid users 10-15 min to sync or stay synced. The chip reader stops working. Upgraded to Premium with promises of more reporting functionality, nothing. still cant pull cash reports. Can only see total cash. None of my product variants are showing up with my pricing variables so im having to charge my customers whatever average price the POS picks. Im losing money here, Shopify.",
    "helpfulCount": 9,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Vera-Lynne Rheeder",
    "rating": 1,
    "date": "April 8, 2022",
    "content": "This is becoming ridiculous! We have lodged complaints 3 times now and every time they say to uninsall an reinstall! It works for a day but then gives problems again! I cannot search for items when I have a client in my store, it's embarrassing! Seriously, fix this problem for the android devices already!",
    "helpfulCount": 12,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Vin Scavo",
    "rating": 1,
    "date": "June 26, 2021",
    "content": "This app is an absolute abomination. It'll work for 5 minutes and then just randomly stop accepting cards. The absolute worst part is the boot up time takes forever. When you're busy small business you can't afford to wait 90 seconds to open a payment processor. Just needs a complete overhaul",
    "helpfulCount": 9,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Parsa Sabouri",
    "rating": 2,
    "date": "May 9, 2022",
    "content": "It's not reliable, after a while the products that we search doesn't show up, we lost customers because they just waited too long..... The products that we search although they are active and available on the online store, isn't available on POS. We have to uninstall once in a while to fix the issue.",
    "helpfulCount": 8,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Pete Cooke",
    "rating": 2,
    "date": "June 7, 2021",
    "content": "I don't really see the point of this app in the UK. Shopify payments (via stripe) don't work with Android devices. This isn't made explicitly clear on sign up. This makes Shopify POS on android tablets or even phones pretty useless as far as I can tell. We have to switch to iOS reluctantly.",
    "helpfulCount": 5,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "A Google user",
    "rating": 5,
    "date": "March 19, 2019",
    "content": "This app works really well in ringing sales in person. It pulls up products quickly and even allows you to make \"quick\" sales without specifying a product. You can also add customer information on the fly. The only trouble I've had with the app is in adding products but then the other shopify app handles that wonderfully.",
    "helpfulCount": 91,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Sandie W.",
    "rating": 1,
    "date": "February 3, 2024",
    "content": "Downloaded this app only to find that NONE of the scans work...either the item is not actually offered...OR....can be holding the EXACT item and it will say that is isn't the item they wanted. If the item won't scan for the measley few points then I'm not going to buy the item either because it's not accepting the barcode. I have not found A SINGLE item at ANY of the stores. It's a waste of time and energy.",
    "helpfulCount": 9,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Paul Tayar",
    "rating": 1,
    "date": "May 18, 2020",
    "content": "DO NOT UPGRADE. Old POS worked fine, new version looks cool and has some nice features but is missing half my inventory. Every 2nd item does not show and I have to manually write a line and then adjust the stock on another app. Not fun with a line of customers. Shopify have advised this is happening to multiple users and not just me. I can't roll back and my POS is a dead weight now. Don't upgrade to the new version until they sort this. It's totally screwed us.",
    "helpfulCount": 10,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Michelle Goyette",
    "rating": 1,
    "date": "October 25, 2022",
    "content": "Actually being able to take swipe, tap, or insert card payments is not possible! HORRID experience. Chipper card reader ($50+) worked great when practicing, then day of event wouldn't work! It only allowed for manual entry of credit cards, which makes the device useless & cost us time + money because people walked away! And it looks sketchy manually entering. ENTIRE day tried to troubleshoot never worked. Once back, contacted support spent and hour + and still won't work! Absolutely distraught.",
    "helpfulCount": 30,
    "developerResponse": null
  },
  {
    "app": "Shopify POS",
    "store": "Play Store",
    "author": "Khristin Quigley",
    "rating": 1,
    "date": "July 20, 2021",
    "content": "Very disappointed in my POS system. Consistantly disconnecting, even mid checkout. Also completely logs me out mid checkout. The card reader disconnects and is so difficult to get it reconnected. I spend more time removing and reinstalling than I should. Frustrating as you are trying to checkout a sale. Thankful for my patient customers! This is not a POS system I would recommend.",
    "helpfulCount": 15,
    "developerResponse": null
  }
]