[
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "B. Simpson",
    "rating": 1,
    "date": "August 25, 2024",
    "content": "I've been using this app for years and never had an issue UNTIL NOW!! I have items that need added to my site, but the app updated on 8/16/24 and it hasn't worked right since! It won't upload a single picture no matter which way I try to do it, no matter where the file is located or what type of file or what size the file is. It won't load them! I can do the description, price, etc. but NO PICTURES. People won't buy if there's no pictures!!",
    "helpfulCount": 147,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "William",
    "rating": 1,
    "date": "February 20, 2026",
    "content": "Processed a $4,500 payment and after Square took their fee, they froze the funds and requested ID verification. I immediately submitted everything, yet they said it will take 3 business days to review. If refunded, it can take up to 7 business days to return to my client. Small businesses rely on cash flow. Freezing funds after processing a legitimate payment is unacceptable. Very disappointed.",
    "helpfulCount": 11,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Ryshelle",
    "rating": 2,
    "date": "February 15, 2026",
    "content": "When it works, it's wonderful. Unfortunately today (during an event where I needed it), the app broke. It first prompted me to download the latest version since the old one was \"no longer compatible.\" I did, tried to sign back in, and got the same message after the update. I had to totally uninstall and reinstall the app to fix the bug - and now tap to pay on my phone is gone. That's the only reason I have the app, and the feature is now missing. It requires hardware in order to use tap now :(",
    "helpfulCount": 11,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Nillastrator",
    "rating": 2,
    "date": "January 5, 2026",
    "content": "I love using square for my pos system at markets, and it's very user friendly/easy to use!! I plan on using it as my main website soon (with the free subscription). I do wish there was an annual subscription cost option instead of just monthly payments. My main problem lately has been that the app keeps undoing my work (when I add an item or image it will save, but when I go back to the item later it's not there anymore). It's been frustrating and unusable since I can't edit or add any new items",
    "helpfulCount": 51,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Cody Buchanan",
    "rating": 5,
    "date": "February 17, 2026",
    "content": "Increased my revenue by being able to accept cards square doubled my customer base not everyone can afford to pay cash but most have a credit or debit card and the small business loans through Square was easy to sign up for went straight into my account and helped with unexpected expenses they also had a great rate and very manageable to be able to pay back",
    "helpfulCount": 2,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Katlynn Stover",
    "rating": 1,
    "date": "February 6, 2026",
    "content": "Was just on the phone over 30 minutes to get my free reader. Absolutely insane! If it's this stressful just setting up I'm worried about trying to use it daily. I had to go in circles with chat bot to even get the number for customer service & they really couldn't even tell me what the problem was. Probably have to use this service for the weekend but definitely looking for something better. VERY DISAPPOINTED!!",
    "helpfulCount": 9,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "WebNet",
    "rating": 5,
    "date": "February 15, 2026",
    "content": "I use the Square mobile app daily for work and it’s been extremely reliable. Payments process quickly, invoices are easy to send, and reporting is clear and accurate. The interface is simple and professional, which helps keep transactions smooth for customers. It saves me time every day and keeps my business organized.",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Charles Taylor",
    "rating": 1,
    "date": "February 18, 2026",
    "content": "I wish I could give 0 stars. I use square for my small business, Electrica. I used their banking services and I truly regret it. For 5 weeks I had to call over and over again to just transfer my money from savings to checking. it took 5 weeks, 25 different people and endless time on hold. a review was only suppose to take 1 to 2 days. I started jan 9th and was told 2 days, and just got it transferred today Feb 18. im deactivating this acct immediately. I never had a more miserable experience",
    "helpfulCount": 2,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Deace ESSC",
    "rating": 1,
    "date": "January 27, 2026",
    "content": "square is the biggest joke of a company I have ever seen! there customer service is the worst ive ever dealt with in my 43 years of life. plus if you try to cash a check, they take the money out of the writers account right away and will not put it in your account for over a week, then when you call in about it, they email you back stating that you have been blocked from calling in to try and figure out where your money is, for a week! this is one of the most fraudulent companies ever!",
    "helpfulCount": 8,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Leonid Voinov",
    "rating": 1,
    "date": "January 20, 2026",
    "content": "Looks modern and easy to use with many features. But when they suddenly hold your money all of that no longer matters. At that point you only remember that the service is unreliable and shows no respect for its users. I would strongly recommend staying away. My business is fully legal and compliant with banks and government requirements. It is safe and transparent. Square pushed online payments and once used my funds were frozen. I never had issues with checks or e-transfers.",
    "helpfulCount": 9,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Mark Hammerling",
    "rating": 3,
    "date": "January 17, 2026",
    "content": "Has been working well but all of a sudden won't sync to either phone, tried everything possible. There is no way to contact support to help in these situations. Not the first time it has had trouble. Might be time to find another supplier if they can't support us considering the always take their fee's",
    "helpfulCount": 4,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Chris Rodgers",
    "rating": 5,
    "date": "January 20, 2026",
    "content": "I've tried several other services and Square is by far the best I've found. More options to receive payments from customers than others. Customer friendly devices so I'm not explaining how to use it. I have had others tell me \"their\" rates were lower. And they were correct but they left out that was \"their\" take and I still had to pay the card companies fee on top of theirs. None of that slick talk with Square. Straight forward and nothing to blindside you with.",
    "helpfulCount": 38,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "AARON LAROCCA",
    "rating": 1,
    "date": "December 20, 2025",
    "content": "I have been using this app now. For a couple years, and every year, it gets worse in the beginning. You used to do a point of sale and the money would be in your square account with in a few hours. Now every transaction they hold for days sometimes weeks to make money off your money, they now say they need to do a review on every transaction e Even if it's the same customer, their 15th transaction shady company they're way far better processing apps out there. I will no longer be using this app.",
    "helpfulCount": 22,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Laefa Padillo",
    "rating": 2,
    "date": "February 5, 2026",
    "content": "updated it and numpad support is gone in certain areas. have to use touchscreen. app wont work with printers that seamlessly work everywhere else. I dont want to shell out $200 for one of their approved printers. confusing system of categories and items.",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Andrei Constantin",
    "rating": 1,
    "date": "January 20, 2026",
    "content": "so I had the square account for a few months for personal use it worked fine with the reader until today,when I logged in it says i need to verify my account so I pressed to verify but it takes me every single time to purchase a reader not to verify anything. square are forcing me to buy another reader when I already have one but either way I tried to buy one to complete the step nothing happened this thing is just crushing and frustrating,I'm waiting for a reply",
    "helpfulCount": 4,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Mr600",
    "rating": 1,
    "date": "February 16, 2026",
    "content": "brand new problem to add to the list.....we pay a membership subscription, yet service is still as poor as before....the map for delivery does NOT update every 20secs so there's no telling where the driver may be or when they may arrive or deliver order, it's increasingly irritating we have to pay for little to NO SERVICE!!",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Dakota Creppel",
    "rating": 1,
    "date": "December 10, 2025",
    "content": "I highly recommend NOT using Square for any transactions. I set up a Square account for a soccer team fundraiser using sales. After the very first sale, I received a notice that my account was under review. I then received a notice that my account was deactivated with no valid reason, and nobody, including a manager, can say what caused the deactivation. They are now holding all funds received for 180 days and do not allow for appeals, even with no chance of charge back from the sales.",
    "helpfulCount": 11,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Otto E. Chew Ottomatic Innovations corp.",
    "rating": 5,
    "date": "February 18, 2026",
    "content": "This is so easy and fun even my dog has a good time ! We figured out the only way it could get any better is if the person who won was the one that actually received the reward not pay pal or cash app. That Sirs would make this experience go from 5 stars to a solid 10",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Jay Rich",
    "rating": 5,
    "date": "January 11, 2026",
    "content": "The \"Square Point Of Sale\" app has been around for years and has managed to stay on top of its game continuing to completely outdo its competitors in every way. Square is very user friendly, it's modern and high tech, Equipped with all desired settings and options that you would want. Now with multiple different choices of debit and credit card readers, Terminals and Point of sale cash registers. It's really the perfect Point Of Sale system for small businesses, entrepreneurs & Beginners alike.",
    "helpfulCount": 19,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Justin Case",
    "rating": 1,
    "date": "February 19, 2026",
    "content": "If you live in a border town , don't bother with this app. call support they couldn't help me. if you're near the border , you cannot collect payments on this app. we'll say invalid location.",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "anthony penwell",
    "rating": 3,
    "date": "December 29, 2025",
    "content": "ok although the fees are very high if I receive a payment transaction of $2,000 they always take $66 out to me that is extremely high as other apps like Square POS apps do not charge near that square is definitely the highest in fees so it would be nice to see them lower their fees because $60 just to process a transaction is insane other than that the app works fine sometimes it takes a while for them to process the transaction",
    "helpfulCount": 10,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Brian Gill",
    "rating": 4,
    "date": "January 31, 2026",
    "content": "Easy to do. I like being able to withhold a percentage of my income for taxes automatically. One downside is that sometimes I need to enter a card manually and I get penalized for that.",
    "helpfulCount": 5,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Laura Griffith",
    "rating": 1,
    "date": "January 12, 2026",
    "content": "they kicked me off with no notice, losing ALL my appt.s & futures appt.s & described services. All I could do was chat with one bot after another who all said the same stuff: \"did you update?\" did you turn your phone off & back on?\" Did you close the app & get back on.\" etc. a WHOLE day, & had to go to a backup acct. Never got it fixed. Thank God for my backup.",
    "helpfulCount": 4,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Evgenii Iakimov",
    "rating": 1,
    "date": "February 19, 2026",
    "content": "They closed my account for no reason after almost a year of operation, with a turnover of $800,000 and two outstanding loans. They're not refunding my account balance! Avoid these scammers! My lawyer is already working on this case.",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Christopher Bridges",
    "rating": 1,
    "date": "January 27, 2026",
    "content": "I am warning you, DO NOT USE THIS APP! They closed my account after I had a few customers pay me through tap to pay. They gave no explanation for closing my account and then told me that I should receive my money 2 days after they hold it for 180 days. I called customer service and was told the explanation for closing account was in email, it wasn't. Asked to speak to supervisor and was told no, I said, so you guys are stealing my money and don't care and Will, the c.s.r. said yeah and laughed.",
    "helpfulCount": 4,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Kevin Brinkley",
    "rating": 3,
    "date": "January 3, 2026",
    "content": "I really like this app and I find it great and it would be five stars all day if y'all could fix this one bug issue where every time my app updates or an invoice is paid or if I move money or something the screen blacks out or lights out where I can't read any of the info and it's always around the 3rd or 4th update or opening or closing the app that it does it consistently making me have to close the app and restart it and wait for it to load back up and as long as I've had this app over a coup",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Roselia Leon",
    "rating": 4,
    "date": "December 15, 2025",
    "content": "near perfect i wish the part where you look at sales for the day was better at looking at fakes in the past. i wish it didn't automatically include sales from today when i want look in the past specifically. and i wish you can select the year easier to you gotta across each month one my one. annoying 😑",
    "helpfulCount": 3,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Brenda Cunningham",
    "rating": 3,
    "date": "February 14, 2026",
    "content": "Always been a great and helpful tool. Only processed 1 sale in a 1 hour window yesterday. Guess my students are without their fundraising monies.",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Josh Bogenreif",
    "rating": 2,
    "date": "January 15, 2026",
    "content": "dear square i.t. department. you keep updating the software but there are subtle changes that slow service down and make it unceasingly more tedious for FOH stave. for example the most 2 recent updates changed the seach bar to a magnifying glass on the top right of where the tabs are and it is not user friendly to exit out of. SLOWING SERVICE DOWN.. another one most recent : the saved ticket feature: the ability to click save ticket and slide CC is now gone and you have to click new customer.",
    "helpfulCount": 3,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Mk Dlamini",
    "rating": 1,
    "date": "January 16, 2026",
    "content": "After signing up online, I tried logging in on the app and it returns an error message \"logged in too many times, account locked try again later\" and that was only inputting the password once.",
    "helpfulCount": 3,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Daniel Gonzales",
    "rating": 1,
    "date": "January 7, 2026",
    "content": "this app is horrible as soon as you start making money they find every reason to hold it and not release it to you they want to verify documents over and over again with the same question same information as the previous time I do not recommend getting this app it is not what they appear to be they make everything extremely difficult for you to transfer money in and out of accounts.",
    "helpfulCount": 7,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Ata Care",
    "rating": 1,
    "date": "December 31, 2025",
    "content": "Please read the response from them to this review. Be ready for them to deactivate your account and when you get in touch with their none existent customers care they'll tell you they decided to cancel your account no other details at all after that you will receive customer care feedback. Update to to this idiotic response I'm not frustrated I'm stunned of your response one day everything is working fine and next day square decided to deactivate your account without any reason or explanation.",
    "helpfulCount": 3,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Evie Hillhouse",
    "rating": 1,
    "date": "November 25, 2025",
    "content": "After just my first time using the square app and card reader, my account was deactivated and all of my funds are unavailable to me for almost 4 months. I wasn't given a chance to appeal and after calling the company they can't even tell me why this was happening. The only \"solution\" they gave me was to refund payments to the original sender, which doesn't help me at all. I highly encourage everyone to search for a different option for their business.",
    "helpfulCount": 20,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Brenna Hauversburk",
    "rating": 3,
    "date": "December 10, 2025",
    "content": "I've been using square for my business for YEARS! I open it up to start the day and the new update says it's no longer compatible with my device! Beyond pissed! While I do LOVE square this really sucks! 1 star on the issue for this morning but 5 stars for the time I've had it.",
    "helpfulCount": 0,
    "developerResponse": "We appreciate you reaching out on this, and we are sorry for any inconvenience this may have caused.\n\nIf you would like, please feel free to reach out to us over any of our support channels and we would be interested to see if there is anything we can help you with. We are here to help."
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Carlos Ayala",
    "rating": 2,
    "date": "January 1, 2026",
    "content": "Within the years, this app is just getting worse, and 6% fee p transaction is quite a lot if you are small business. There are more convenient options out there.",
    "helpfulCount": 2,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Dan Pugsley",
    "rating": 1,
    "date": "January 28, 2026",
    "content": "these checks are worthless. I have 2 checks & I can't deposit them into my bank of america account by mobile deposit, or the atm. PayPal has also declined my checks. I created a square account, they also declined both checks. It's unbelievable. I have to contact the issuer and hope they can write me a personal check because square checks are not able to be deposited into any account ive tried several different ways. I have ran out of options. has anyone ever had success with these checks?",
    "helpfulCount": 2,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Ryan",
    "rating": 1,
    "date": "January 27, 2026",
    "content": "DO NOT DOWNLOAD!!!! THEY TAKE YOUR MONEY BUT DO NOT DEPOSIT IT. They've had my money for a week already and keep changing the transfer date. isn't it convenient you can't talk to any costumer service 🤔.",
    "helpfulCount": 3,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Doug Dunn",
    "rating": 3,
    "date": "January 21, 2026",
    "content": "The fees are steep but there are benefits. There are cheaper options available from your bank (if available). If other options aren't available, this app offers a range of services to help manage the finances of your business.",
    "helpfulCount": 0,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Marti K.",
    "rating": 5,
    "date": "January 8, 2026",
    "content": "Quick & easy to use, mobile works just as well as desktop, reasonable cost, fast transfers, solid back end API to integrate into an e-commerce website, easy to read reports. Been using Square for a while now. I like it quite a bit.",
    "helpfulCount": 8,
    "developerResponse": null
  },
  {
    "app": "Square POS",
    "store": "Play Store",
    "author": "Walton Prosen",
    "rating": 2,
    "date": "February 20, 2026",
    "content": "The app quit working and customer service was outsourced. I don't speak broken English.",
    "helpfulCount": 0,
    "developerResponse": null
  }
]